#+BEGIN_COMMENT
.. title: PyTorch and the Unknown CUDA Error
.. slug: pytorch-and-the-unknown-cuda-error
.. date: 2022-10-31 17:58:27 UTC-07:00
.. tags: pytorch,cuda,troubleshooting
.. category: CUDA
.. link: 
.. description: Fixing the pytorch unknown CUDA error.
.. type: text
.. status: 
.. updated: 

#+END_COMMENT
#+OPTIONS: ^:{}
#+OPTIONS: H:5
#+TOC: headlines 2
#+BEGIN_SRC python :session fastai :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC
#+PROPERTY: header-args :session ~/.local/share/jupyter/runtime/kernel-9c7661bb-c4e1-4dc7-9666-2039ec24943a-ssh.json
* The Symptom

This is what happens if I try to use CUDA after waking the machine from a suspend.

#+begin_src python :results output :exports both
import torch

torch.cuda.is_available()
#+end_src

#+RESULTS:
: /home/athena/.conda/envs/neurotic-fastai/lib/python3.9/site-packages/torch/cuda/__init__.py:88: UserWarning: CUDA initialization: CUDA unknown error - this may be due to an incorrectly set up environment, e.g. changing env variable CUDA_VISIBLE_DEVICES after program start. Setting the available devices to be zero. (Triggered internally at /opt/conda/conda-bld/pytorch_1666642975993/work/c10/cuda/CUDAFunctions.cpp:109.)
:   return torch._C._cuda_getDeviceCount() > 0

As you can see, the error message doesn't really give any useful information about what's wrong - there /are/ a couple of suggestions but neither seems relevant or at least doesn't lead you to the fix.

